// оператор присваивания =
// const a = 5;

// операнд - когда на записи есть название переменной, оператор присваивания и значение этой переменной,
// то к чему применятся оператор
const a = 5; // присваиваем оператор присваивания к первому операнду и ко второму операнду

// бинарные операторы применяются к двум операндам
const sum = 2 + 2 // + оператор 2 операнд
console.log(sum)

console.log(3 ** 2)
console.log(5 % 2)

// унарный оператор производит действие с одним операндом
console.log(+'2') // 2:number

var num1 = 4;
num1++;
console.log(num1)